---
kind: method
id: M:Autodesk.Revit.DB.Structure.RebarConstraint.Dispose
source: html/b118907f-08c3-742d-01f4-e50db6d065f5.htm
---
# Autodesk.Revit.DB.Structure.RebarConstraint.Dispose Method

Releases all resources used by the RebarConstraint

## Syntax (C#)
```csharp
public void Dispose()
```